## 🐍SUMMER CAMP 2020 SQL WEEK3

### 1. 알아둬야할 5 STEP

In [3]:
import pymysql # 파이썬은 많은 라이브러리가 있고 그 중에 하나가 mysql을 파이썬으로 사용할 수 있는 라이브러리

In [4]:
db = pymysql.connect(host='localhost', port=3306, user='root', passwd='Myloxyloto5!', db='ecommerce', charset='utf8')
#localhost my computer
#port 외부 접속 왔을 때 어떤 프로그램을 쓰는지? 특정 포트 번호 = 프로그램마다 있음 mysql 디폴트 번호 3306

In [5]:
db #접속이 된 상태가 객체로 넘어왔다, 객체표시 붕어빵 틀로 찍어냄~

In [4]:
ecommerce = db.cursor() #명령을 받을 수 있는 상태

In [5]:
ecommerce #커서라는 객체가 접속 실제 명령을 내릴 수 있는 상태 ---- 준비 상태 끝!

```
create database ecommerce;
use ecommerce;
show databases;
create table product (
	product_code varchar(20) not null,
    title varchar(200) not null,
    ori_price int,
    discount_price int,
    discount_percent int,
    delivery varchar(2),
    primary key(product_code)
);
desc product;
   
create table ranking (
	id int unsigned not null auto_increment,
    category varchar(50),
    subcategory varchar(50),
    ranking int not null,
    product_code varchar(20) not null,
    primary key(id)
);
desc ranking;

insert into product values('215673140', '스위트바니 여름신상5900원~롱원피스티셔츠/긴팔/반팔',23000,6900,70,'F');
select* from product;
```

In [6]:
sql = """
    create table product (
	product_code varchar(20) not null,
    title varchar(200) not null,
    ori_price int,
    discount_price int,
    discount_percent int,
    delivery varchar(2),
    primary key(product_code)
);
"""

In [7]:
ecommerce.execute(sql)

0

In [8]:
db.commit() # 커넥트 수행한 객체 실행한 구문 실제로 실행해! 라는 뜻

In [9]:
db.close()

### 2.

In [10]:
import pymysql

db = pymysql.connect(host='localhost', port=3306, user='root', passwd='Myloxyloto5!', db='ecommerce', charset='utf8')

cursor = db.cursor()

for index in range(10):
    product_code = 215673140 + index + 1
    sql = """INSERT INTO product VALUES(
    '""" + str(product_code) + """', '스위트바니 여름신상5900원~롱원피스티셔츠/긴팔/반팔', 23000, 6900, 70, 'F'); """
    print (sql)
    cursor.execute(sql)

db.commit()
db.close()

INSERT INTO product VALUES(
    '215673141', '스위트바니 여름신상5900원~롱원피스티셔츠/긴팔/반팔', 23000, 6900, 70, 'F');
INSERT INTO product VALUES(
    '215673142', '스위트바니 여름신상5900원~롱원피스티셔츠/긴팔/반팔', 23000, 6900, 70, 'F');
INSERT INTO product VALUES(
    '215673143', '스위트바니 여름신상5900원~롱원피스티셔츠/긴팔/반팔', 23000, 6900, 70, 'F');
INSERT INTO product VALUES(
    '215673144', '스위트바니 여름신상5900원~롱원피스티셔츠/긴팔/반팔', 23000, 6900, 70, 'F');
INSERT INTO product VALUES(
    '215673145', '스위트바니 여름신상5900원~롱원피스티셔츠/긴팔/반팔', 23000, 6900, 70, 'F');
INSERT INTO product VALUES(
    '215673146', '스위트바니 여름신상5900원~롱원피스티셔츠/긴팔/반팔', 23000, 6900, 70, 'F');
INSERT INTO product VALUES(
    '215673147', '스위트바니 여름신상5900원~롱원피스티셔츠/긴팔/반팔', 23000, 6900, 70, 'F');
INSERT INTO product VALUES(
    '215673148', '스위트바니 여름신상5900원~롱원피스티셔츠/긴팔/반팔', 23000, 6900, 70, 'F');
INSERT INTO product VALUES(
    '215673149', '스위트바니 여름신상5900원~롱원피스티셔츠/긴팔/반팔', 23000, 6900, 70, 'F');
INSERT INTO product VALUES(
    '215673150', '스위트바니 여름신상5900원~롱원피스티셔츠/긴팔/반팔', 23000, 6900, 70, 'F');

디키즈(광주신세계)디키즈 여름시즌오프 5종 택 1 (TST686/TST687/TST688/TST689/TST690)
10,000원
8,080원
19

In [6]:
import pymysql

cursor = db.cursor()
sql = """
update product set 
    title = '디키즈(광주신세계)디키즈 여름시즌오프 5종 택 1 (TST686/TST687/TST688/TST689/TST690)', 
    ori_price = 10000, 
    discount_price = 8080,
    discount_percent = 19
    where product_code='215673141'
"""

cursor.execute(sql)
db.commit()
db.close()

1. 라이브러리 가져오기
2. 접속하기
3. 커서 가져오기
4. SQL 구문 만들기
5. SQL 구문 실행하기
6. commit 하기
7. close 하기

In [26]:
g_title = ['메이킹유 5900~ 원피스/블라우스/니트 빅사이즈','[디키즈](광주신세계)디키즈 여름시즌오프 5종 택 1 (TST686/TST687)',
           '[이너리즘]1+1 오픈 백 노와이어 브라탑 브라렛 2장','[예스]예스 외 17%쿠폰 브라+팬티 2종SET 신규물량 업데이트',
           '다온샵 신상+여름SLAE 추가10% 청바지/일자/린넨 3XL~','달리샵 딱 찾던 핏 인기 많은 원피스/블라우스',
           '[이지바이]창고대방출 마지막재고 등산/아웃도어/트레이닝 49~','풍기인견 파격세일 엄마옷로즈맘 50대중년여성의류',
           '시크루즈/시즌오프/원피스/SET상품/빅사이즈','시스터 빅세일 5900~빅사이즈롱티/롱원피스/세트/팬츠']
g_price = [33000,10000,23000,30980,33000,33000,16300,43000,43000,19600]
g_disp = [9900,8080,6900,9510,9900,9900,4900,12900,12900,5900]
g_dispc = [70,19,70,69,70,70,69,70,70,69]


import pymysql

db = pymysql.connect(host='localhost', port=3306, user='root', passwd='Myloxyloto5!', db='ecommerce', charset='utf8')

cursor = db.cursor()
sql = """
update product set 
    title = '시스터 빅세일 5900~빅사이즈롱티/롱원피스/세트/팬츠', 
    ori_price = 19600, 
    discount_price = 5900,
    discount_percent = 69
    where product_code='215673150'
"""
cursor.execute(sql)

db.commit()
db.close()

# 같은 자료형끼리만 연결 가능...
# 메모장에 csv 만들어서 넣으면 되었음...ㅋ

### 3. foreign key

In [1]:
import pymysql
import pandas as pd

db = pymysql.connect(host='localhost', port=3306, user='root', passwd='Myloxyloto5!', db='sqldb', charset='utf8')
sql = 'select* from userTbl'
df = pd.read_sql(sql, db)
df

  userID name  birthYear addr mobile1   mobile2  height       mDate
0    BBK  바비킴       1973   서울     010  00000000     176  2013-05-05
1    EJW  은지원       1972   경북     011  88888888     174  2014-03-03
2    JKW  조관우       1965   경기     016  99999999     172  2010-10-10
3    JYP  조용필       1950   경기     011  44444444     166  2009-04-04
4    KBS  김범수       1979   경남     011  22222222     173  2012-04-04
5    KKH  김경호       1971   전남     019  33333333     177  2007-07-07
6    LJB  임재범       1963   서울     016  66666666     182  2009-09-09
7    LSG  이승기       1987   서울     011  11111111     182  2008-08-08
8    SSK  성시경       1979   서울    None      None     186  2013-12-12
9    YJS  윤종신       1960   경남    None      None     170  2005-05-05

In [2]:
cursor = db.cursor()

SQL = "select * from buyTbl"
df = pd.read_sql(SQL, db)
df

두 테이블 간의 관계를 확인해야 합니다.   
테이블을 연결해주는 외부키 데이틀 간의 관계를 연결, 제한(?) 해주는 외부 키

In [4]:
cursor = db.cursor()
SQL_QUERY = "INSERT INTO buyTbl (userID, prodName, groupName, price, amount) VALUES('BBK', '운동화', '의류', 30, 2);"
cursor.execute(SQL_QUERY)
db.commit()

user table에 user ID에 새로운 사람을 넣어야겠다고 한다면 먼저 입력할 때 넣어주어야한다.